import { link } from "fs";

export const NAV_ITEMS = [
  {
    id: 0,
    name: "Птица/Мясо",
    link: "/category/0",
    img: "/bird.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 1,
    name: "Полуфабрикаты",
    link: "/category/1",
    img: "/polyfabricat.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 2,
    name: "Маринады",
    link: "/category/2",
    img: "/marinad.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 3,
    name: "Мясные деликатесы",
    link: "/category/3",
    img: "/delicates-1.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 4,
    name: "Молочная продукция, яйца",
    link: "/category/4",
    img: "/eggs.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 5,
    name: "Сыры",
    link: "/category/5",
    img: "/eggs.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 6,
    name: "Подарочные наборы",
    link: "/category/6",
    img: "/eggs.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
  {
    id: 7,
    name: "Консервация",
    link: "/category/7",
    img: "/eggs.jpg",
    subCategories: [
      {
        id: 1,
        label: "Подкатегория 1",
      },
      {
        id: 2,
        label: "Подкатегория 2",
      },
      {
        id: 3,
        label: "Подкатегория 3",
      },
    ],
  },
];

export const PRODUCT_CARDS = [
  {
    id: 0,
    name: "Филе бедра индейки",
    img: "/delicates-1.jpg",
    link: "/product/0",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 1,
    name: "Бедро цыпленка-бройлера",
    img: "/bird.jpg",
    link: "/product/1",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 2,
    name: "Бедро цыпленка-бройлера",
    img: "/eggs.jpg",
    link: "/product/2",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 3,
    name: "Бедро цыпленка-бройлера",
    img: "/marinad.jpg",
    link: "/product/3",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 4,
    name: "Бедро цыпленка-бройлера",
    img: "/delicates-1.jpg",
    link: "/product/4",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 5,
    name: "Бедро цыпленка-бройлера",
    img: "/delicates-1.jpg",
    link: "/product/5",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 6,
    name: "Бедро цыпленка-бройлера",
    img: "/delicates-1.jpg",
    link: "/product/6",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
  {
    id: 7,
    name: "Бедро цыпленка-бройлера",
    img: "/delicates-1.jpg",
    link: "/product/7",
    price: "910",
    unit: {
      value: 1,
      name: "кг",
    },
    description: [
      {
        name: "Цена:",
        text: "товар весовой, конечная стоимость будет рассчитана в соответствии с его весом.",
      },
      {
        name: "Вес:",
        text: "1 кг. (0.5-1.5кг.)",
      },
      {
        name: "Важно:",
        text: "допускается наличие небольшого количества перьев на кожном покрове в силу ручного ощипывания.",
      },
      {
        name: "Срок годности:",
        text: "180 суток.",
      },
      {
        name: "Условия хранения: ",
        text: "При температуре не выше -18 °С. После вскрытия хранится 24 часа при температуре от +0 до +2 °С.",
      },
    ],
  },
];
